Revit 2027 API
DuctFittingAndAccessoryData.DynamicViscosity Property
 The dynamic viscosity of air for the duct fitting or duct accessory, Units: (kg/(ft·s)).
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DynamicViscosity { get; }
Public ReadOnly Property DynamicViscosity As Double
	Get
public:
property double DynamicViscosity {
	double get ();
}
member DynamicViscosity : float with get
Property Value
Double
See Also
Reference
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace